yii-advanced-app-2.0.32/advanced/frontend/models/WishForm.php

    public function getList()
    {
    	$model = new Wishes();
    	$res=$model->find()
    	       ->limit(8)
    	       ->with('user')
    	       ->orderBy(['id'=>SORT_DESC])
    	       ->asArray()
    	       ->all();
---
SELECT * FROM `user` WHERE `id` IN (5, 4, 3, 2)